Revit 2027 API
MEPBuildingConstructionSet.GetEnumerator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator
public:
virtual IEnumerator^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator
override GetEnumerator : unit -> IEnumerator
Return Value
IEnumerator
Returns a forward moving iterator to the set.
Implements
IEnumerable.GetEnumerator()
See Also
Reference
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace